CSI API ETABS v1

# cSapModelTendonObj Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cTendonObj TendonObj { get; }

    ReadOnly Property TendonObj As cTendonObj
    	Get

    Dim instance As cSapModel
    Dim value As cTendonObj

    value = instance.TendonObj

    property cTendonObj^ TendonObj {
    	cTendonObj^ get ();
    }

    abstract TendonObj : cTendonObj with get

#### Property Value

Type: cTendonObj

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com